let Messages = {
	"initialize": " 2050, vengo in pace...",
	"info":"yolo, queste sono le info, puoi inserire continue o info",
	"mex1":"Agente: Ehi amico. Non so se ti rendi conto del casino che hai combinato. Quella cosa che hai appena fatto, premere su \"accetta\" senza leggere i termini e condizioni d'uso, secondo i nostri scienziati è stato l'evento che ha dato inizio a tutto. ",
	"mex2":"Ti sto scrivendo questo messaggio dal futuro, dal 2118 ad esser precisi. Non so per quanto riuscirò ancora a restare collegato, quindi ti spiegherò velocemente quello che devi fare.",
	"mex3":"Scrivi \"ok\" quando sei pronto.",

	"mex4":"Agente N: Bene. Vedo che si collaborativo.  Al momento posso solo spiegarti in breve chi sono e cosa voglio da te. Sono N (o altro nome), un agente segreto che lavora per la fazione dei ribelli che sta cercando di ribaltare il governo autoritario che è stato instaurato grazie ai dati che la TIGMADEEVA ha raccolto e usato per influenzare le elezioni politiche qui a Nexa City.",
	"mex5":"Un gruppo di scienziati della nostra fazione ha scoperto che il momento esatto in cui hai premuto su \"accetta\" hai scatenato la catena di eventi che ha portato a questo. ",
    "mex6":"Hai presente il Butterfly effect, no? A quanto pare l'unico modo che abbiamo per poter salvare il nostro presente è quello di cambiare il passato, ma dal momento che le macchine del tempo esistono solo nei film di fantascienza e non possiamo impedire che tu prema quel maledetto pulsante, sarai tu a doverti sporcare le mani.",
    "mex7":"E non chiederti come sia possibile questa conversazione tra presente e futuro, se ne occupano i nostri informatici, Dovresti parlarne con loro ma sono leggermente impegnati a salvare il mondo al momento. Ok, ecco cosa devi fare: prendi uno smartphone, credo si chiamino ancora così quei cosi, e apri lo store, scarica l'app HP Reveal, iscriviti con i tuoi dati (mi raccomando, dai almeno un'occhiata alle condizioni d'uso stavolta) e segui il canale HACKTHESYSTEM. Mandami un \"fatto\" quando hai finito.",

	"mex8":"Agente N: Ottimo. Quello che dovrai fare sarà girare per il politecnico di Torino, luogo dove sorgerà la sede della futura TIGMADEEVA, e cercare le tre cabine armadio su cui saranno disegnati dei codici QR. Inquadrali con l'app che ti ho dato e dai inizio all'hackeraggio. Non dovrai fare null'altro: l'app installerà degli spyware nei sistemi dell'azienda che ci permetteranno di controllare tutti i dati che immagazzineranno e di cifrarli in modo che in futuro non possano sfruttarli per i loro scopi malefici. Ti permetterà inoltre di accedere ad alcuni files, provenienti dal futuro che noi ribelli useremo per incastrarli. Un'ultima cosa: potresti trovare delle password durante l'hackeraggio. Memorizzale e vai su questo sito dopo che ti sei collegato con il primo server, potrai accedere al PC personale del CEO della TIGMADEEVA dove conserva tutte le prove incriminanti che sono riusciti ad insabbiare. Con le password trovate potrai accedere a tutti i documenti che hai trovato nel tuo percorso. Sì, lo so che avrai mille domande su chi sia io o di cosa stia parlando, ma non ho molto tempo. ho creato un documento che contiene tutte le risposte che cerchi. Se vuoi sperne di più, scrivi \"info\" qui sotto, ti verrà inviato in automatico un file di testo che riassume tutta la situazione.Merda, mi stanno tracciando. Fai in fretta, il futuro dipende da te. Ci rivedr",
}